### 1. DataFrame

In [52]:
import numpy as np
import pandas as pd

- DF 생성방법1 : 2차원 데이터, 컬럼명, 인덱스

In [53]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),      # 2차원 데이터
    columns=list('xyz'),                                # columnName 지정
    index =list('가나다라')
)
df1

    x   y    z
가  76  83  100
나  95  62   49
다  81  63   47
라  69  71   56

- DF 생성방법2: 딕셔너리의 리스트

In [54]:
data = [
    {'X': 83, 'Y': 59, 'Z' : 53},
    {'X': 45, 'Y': 59, 'Z' : 45},
    {'X': 50, 'Y': 89, 'Z' : 86},
    {'X': 100, 'Y': 46, 'Z' : 77}
]

df2 = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df2

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

- DF 생성방법3: 데이터가 value, 컬럼명이 key가 되는 dict

In [55]:
data = {
    'X':[83, 45, 50, 100],
    'Y':[59,59,89,46],
    'Z':[53,45,86,77]
}

df3 = pd.DataFrame(data, index=list('abcd'))
df3

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  86
d  100  46  77

In [56]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [57]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [58]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [59]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [60]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [61]:
temp = [
    {'탑': '다리우스', '미드':'탈론' , '정글':'리신' , '원딜':3.0 , '서폿':1},
    {'탑': '마오카이','미드': '신드라', '정글': 4.0, '원딜': '사미라', '서폿': '나미'},
    {'탑': '아트록스','미드': '리산드라', '정글': 5, '원딜': 1.0, '서폿': '브라움'},
    {'탑': '갱플랭크','미드': '룰루', '정글': '케인', '원딜': 3.0, '서폿': '알리스타'},
    {'탑': '베인','미드': '오리아나', '정글': '15', '원딜': '하이머딩거', '서폿':5.0 }
]

temp_df = pd.DataFrame(temp, index=['Team1', 'Tema2', 'Team3', 'Team4', 'Team5'])
temp_df

          탑    미드   정글     원딜    서폿
Team1  다리우스    탈론   리신    3.0     1
Tema2  마오카이   신드라  4.0    사미라    나미
Team3  아트록스  리산드라    5    1.0   브라움
Team4  갱플랭크    룰루   케인    3.0  알리스타
Team5    베인  오리아나   15  하이머딩거   5.0

In [62]:
col_A,col_B,col_C,col_D,col_E = [], [], [], [], []
np.random.seed = 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65, 91))+ chr(np.random.randint(65, 91)))
    col_B.append((np.random.randint(1, 7)))
    col_C.append((np.random.randint(40, 101)))
    col_D.append((np.random.randint(1, 100) * 1000))
    col_E.append(np.round(np.random.rand(), 4))
df4 = pd.DataFrame(
    {'col_A':col_A, 'col_B':col_B, 'col_C':col_C, 'col_D':col_D, 'col_E':col_E}
)
df4

  col_A  col_B  col_C  col_D   col_E
0    NW      5     52  47000  0.3290
1    RD      5     59  15000  0.9174
2    GL      5     40  95000  0.3633
3    CQ      6     63  96000  0.9328
4    UR      6     87  55000  0.0676

In [63]:
temp_data = []
np.random.seed = 2023
for i in range(5):
    temp_data.append({
    'col_A':chr(np.random.randint(65, 91))+ chr(np.random.randint(65, 91)),
    'col_B':np.random.randint(1, 7), 
    'col_C':np.random.randint(40, 101),
    'col_D':np.random.randint(1, 100) * 1000, 
    'col_E':np.round(np.random.rand(), 4)})

pd.DataFrame(temp_data)

  col_A  col_B  col_C  col_D   col_E
0    IP      1     69  86000  0.6789
1    QX      6     50   1000  0.1072
2    KW      6     90  17000  0.4509
3    ZW      5     46  55000  0.3028
4    DU      6     86  24000  0.1327

- 전치(TransPose)

In [64]:
df1.T

     가   나   다   라
x   76  95  81  69
y   83  62  63  71
z  100  49  47  56

In [65]:
df4.T

           0       1       2       3       4
col_A     NW      RD      GL      CQ      UR
col_B      5       5       5       6       6
col_C     52      59      40      63      87
col_D  47000   15000   95000   96000   55000
col_E  0.329  0.9174  0.3633  0.9328  0.0676

- 열 데이터의 갱신 / 추가 / 삭제

In [66]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [67]:
# 데이터 갱신(값 수정) 접근법
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [68]:
# 데이터 추가 : 열이름이 존재하면 수정, 없으면 추가
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [69]:
# 열 삭제
del df['2010-2015 증가율']
df

항목   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

- 열 인덱싱

In [70]:
df['지역']      # 열 이름을 하나만 인덱싱하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [71]:
df[['2015', '2010']]        # 열 이름을 두개이상 인덱싱하면 DF타입 반환

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [72]:
df[['2015']]

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 개별 인덱싱

In [73]:
# 열 이름, 행 인덱싱
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [74]:
# 컬럼명이 숫자, 특문등 포함되면 df.2015[''] 꼴 불가
df.2015.['서울']

- 연습문제

In [75]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [76]:
#1
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [77]:
#2
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [78]:
#3
df['평균'] = ((df.국어 + df.영어 + df.수학) / 3).round(1)

In [83]:
#4
df['영어'][2] = 80
df['평균'] = ((df.국어 + df.영어 + df.수학) / 3).round(1)
df

C:\Users\choib\AppData\Local\Temp\ipykernel_9268\680246081.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어'][2] = 80

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  80  80  76.7
방자  30  40  70  46.7

In [80]:
#5
df.T[['춘향']]

      춘향
국어  80.0
영어  90.0
수학  90.0
평균  86.7

In [81]:
#6
df.T['향단']

국어    70.0
영어    80.0
수학    80.0
평균    76.7
Name: 향단, dtype: float64